<?php

return [
    'backups' => 'النسخ الاحتياطية',
    'manage-backups' => 'إدارة النسخ الاحتياطية',
    'create-backup' => 'إنشاء نسخة احتياطية',
    'have-been-allocated' => 'تم إنشاء {{current}} من أصل {{max}} نسخة احتياطية لهذا الخادم.',

    'name' => 'الاسم',
    'size' => 'الحجم',
    'creation-date' => 'تاريخ الإنشاء',
    'checksum' => 'المجموع الاختباري (Checksum)',

    'failed' => 'فشل',
    'continue' => 'متابعة',

    'download' => 'تنزيل',
    'restore' => 'استعادة',
    'lock' => 'قفل',
    'unlock' => 'إلغاء القفل',
    'delete' => 'حذف',

    'limit-is-0' => 'لا يمكن إنشاء نسخ احتياطية لهذا الخادم لأن الحد المسموح به هو 0.',
    'try-going-back' => 'يبدو أنه لا توجد المزيد من النسخ الاحتياطية لعرضها، جرب العودة إلى الصفحة السابقة.',
    'no-backups' => 'يبدو أنه لا توجد نسخ احتياطية محفوظة لهذا الخادم حالياً.',
    'no-longer-protected' => 'لن تعد هذه النسخة الاحتياطية محمية من الحذف التلقائي أو غير المقصود.',
    'your-server-will-be-stopped' => 'سيتم إيقاف خادمك. لن تتمكن من التحكم في حالة التشغيل أو الوصول إلى مدير الملفات أو إنشاء نسخ احتياطية إضافية حتى تكتمل العملية.',
    'delete-all-files' => 'حذف جميع الملفات قبل استعادة النسخة الاحتياطية.',
    'permanent-operation' => 'هذه العملية نهائية. لا يمكن استعادة النسخة الاحتياطية بمجرد حذفها.',

    'create' => [
        'title' => 'إنشاء نسخة احتياطية للخادم',
        'backup-name' => 'اسم النسخة الاحتياطية',
        'backup-name-description' => 'الاسم المستخدم للإشارة إلى هذه النسخة الاحتياطية (اختياري).',
        'ignored-files-directories' => 'الملفات والمجلدات المستثناة',
        'ignored-files-directories-description' => 'أدخل الملفات أو المجلدات المراد استثناؤها عند إنشاء هذه النسخة الاحتياطية. اتركه فارغاً لاستخدام محتويات ملف .pteroignore في المجلد الرئيسي للخادم إذا كان موجوداً. تدعم مطابقة الرموز البديلة (*) بالإضافة إلى إلغاء القاعدة بوضع علامة التعجب (!) في بداية المسار.',
        'locked' => 'مقفلة',
        'locked-description' => 'حماية هذه النسخة الاحتياطية من الحذف حتى يتم إلغاء قفلها يدوياً.',
        'start' => 'بدء النسخ الاحتياطي',
    ]
];
