<?php

return [
    'settings' => 'الإعدادات',

    'sftp' => [
        'title' => 'تفاصيل SFTP',
        'server-address' => 'عنوان الخادم',
        'username' => 'اسم المستخدم',
        'description' => 'كلمة مرور SFTP هي نفسها كلمة المرور المستخدمة للدخول إلى هذه اللوحة.',
        'launch-sftp' => 'فتح بروتوكول SFTP',
    ],

    'rename' => [
        'title' => 'تغيير تفاصيل الخادم',
        'server-name' => 'اسم الخادم',
        'server-description' => 'وصف الخادم',
        'save' => 'حفظ',
    ],

    'debug' => [
        'title' => 'معلومات تصحيح الأخطاء',
        'node' => 'العقدة',
        'server-id' => 'معرف الخادم',
    ],

    'reinstall' => [
        'title' => 'إعادة تثبيت الخادم',
        'reinstall-started' => 'بدأ خادمك عملية إعادة التثبيت.',
        'confirm-reinstallation' => 'تأكيد إعادة تثبيت الخادم',
        'yes-reinstall' => 'نعم، أعد تثبيت الخادم',
        'are-you-sure' => 'سيتم إيقاف خادمك وقد يتم حذف أو تعديل بعض الملفات أثناء هذه العملية، هل أنت متأكد من رغبتك في المتابعة؟',
        'desc-1' => 'ستؤدي إعادة تثبيت الخادم إلى إيقافه، ثم إعادة تشغيل برنامج التثبيت الذي قام بإعداده في البداية.',
        'desc-2' => 'قد يتم حذف أو تعديل بعض الملفات أثناء هذه العملية، يرجى حفظ نسخة احتياطية لبياناتك قبل المتابعة.',
        'reinstall-server' => 'إعادة تثبيت الخادم',
    ],
];
