<?php

return [
    'title' => 'المستخدمون',
    'manage-subusers' => 'إدارة المستخدمين الفرعيين',
    'new-user' => 'مستخدم جديد',

    'no-users' => 'يبدو أنه ليس لديك أي مستخدمين فرعيين.',

    'name' => 'الاسم',
    'email' => 'البريد الإلكتروني',
    '2FA-enabled' => 'المصادقة الثنائية مفعلة',
    'creation-date' => 'تاريخ الإنشاء',
    'modify-permissions' => 'تعديل الصلاحيات',

    'user-email' => 'البريد الإلكتروني للمستخدم',
    'user-email-description' => 'أدخل البريد الإلكتروني للمستخدم الذي ترغب في دعوته كمستخدم فرعي لهذا الخادم.',

    'select-all-permissions' => 'تحديد جميع الصلاحيات',
    'modify-permissions-for' => 'تعديل الصلاحيات لـ',
    'view-permissions-for' => 'عرض الصلاحيات لـ',
    'create-new-subuser' => 'إنشاء مستخدم فرعي جديد',
    'must-not-exceed' => 'يجب ألا يتجاوز البريد الإلكتروني 191 حرفاً.',
    'valid-email' => 'يجب إدخال عنوان بريد إلكتروني صالح.',
    'save' => 'حفظ',
    'invite-user' => 'دعوة مستخدم',

    'only-permissions-you-assigned' => 'يمكن فقط تحديد الصلاحيات الممنوحة لحسابك حالياً عند إنشاء أو تعديل مستخدمين آخرين.',

    'delete-this-subuser' => 'هل تريد حذف هذا المستخدم الفرعي؟',
    'yes-remove' => 'نعم، احذف المستخدم الفرعي',
    'are-you-sure-to-remove' => 'هل أنت متأكد من رغبتك في حذف هذا المستخدم الفرعي؟ سيتم إلغاء وصوله بالكامل إلى هذا الخادم فوراً.'
];
