<?php

return [
    'account-overview' => 'نظرة عامة على الحساب',
    'twofactor-messagebox' => 'يجب تفعيل المصادقة الثنائية في حسابك للمتابعة.',
    'apikey' => 'مفتاح API',
    'sshkey' => 'مفتاح SSH',

    'update-password' => [
        'current' => 'كلمة المرور الحالية',
        'new' => 'كلمة المرور الجديدة',
        'requirements' => 'يجب أن تتكون كلمة المرور الجديدة من 8 أحرف على الأقل وتكون خاصة بهذا الموقع.',
        'confirm' => 'تأكيد كلمة المرور الجديدة',
        'update' => 'تحديث كلمة المرور',
    ],

    'update-email' => [
        'isUpdated' => 'تم تحديث بريدك الإلكتروني الأساسي',
        'update' => 'تحديث البريد الإلكتروني',
        'email' => 'البريد الإلكتروني',
        'confirm' => 'تأكيد كلمة المرور',
    ],

    'appearance' => [
        'title' => 'المظهر',
        'lightDarkMode' => 'الوضع الفاتح / الداكن',
        'light' => 'فاتح',
        'dark' => 'داكن',
        'language' => 'لغة اللوحة',
        'panel-sounds' => 'أصوات اللوحة',
        'on' => 'مفعل',
        'off' => 'معطل',
        'privacy-mode' => 'وضع الخصوصية',
    ],

    'twofactor' => [
        'title' => 'المصادقة الثنائية',
        'isEnabled' => 'التحقق بخطوتين مفعل حالياً في حسابك.',
        'isDisabled' => 'التحقق بخطوتين غير مفعل في حسابك حالياً. اضغط على الزر أدناه للبدء في إعداده.',
        'disable' => 'تعطيل التحقق بخطوتين',
        'enable' => 'تفعيل التحقق بخطوتين',
        
        'disable-dialog' => [
            'password' => 'كلمة المرور',
            'cancel' => 'إلغاء',
            'must-enter-password' => 'يجب إدخال كلمة مرور حسابك للمتابعة.',
            'disable' => 'تعطيل',
        ],

        'setup-dialog' => [
            'description' => 'امسح رمز الاستجابة السريعة (QR) أعلاه باستخدام تطبيق المصادقة الثنائية الذي تفضله. ثم أدخل الرمز المكون من 6 أرقام في الحقل أدناه.',
            'account-password' => 'كلمة مرور الحساب',
            'qrcode-loading' => 'بانتظار تحميل رمز QR...',
            'enter-6digit-password' => 'يجب إدخال الرمز المكون من 6 أرقام وكلمة المرور للمتابعة.',
            'enable' => 'تفعيل',
            'cancel' => 'إلغاء',
        ],
    ],

    'apiKey' => [
        'label' => 'الوصف',
        'description' => 'وصف لمفتاح API هذا.',
        'allowedIPs-label' => 'عناوين IP المسموح بها',
        'allowedIPs-description' => 'اتركه فارغاً للسماح لأي عنوان IP باستخدام هذا المفتاح، أو اكتب كل عنوان IP في سطر مستقل.',
        'createButton' => 'إنشاء',

        'your-keys' => 'مفتاح API الخاص بك',
        'store-save' => 'يظهر مفتاح API المطلوب أدناه. يرجى حفظه في مكان آمن، فلن يتم عرضه مرة أخرى.',
        'close' => 'إغلاق',

        'delete-api-key' => 'حذف مفتاح API',
        'delete-key' => 'حذف المفتاح',
        'all-requests-invalidated-1' => 'سيتم إبطال جميع الطلبات التي تستخدم المفتاح',
        'all-requests-invalidated-2' => 'بشكل نهائي.',
        'loading' => 'جاري التحميل...',
        'no-key-found' => 'لا توجد مفاتيح API لهذا الحساب.',
        'last-used' => 'آخر استخدام',
    ],

    'sshKey' => [
        'loading' => 'جاري التحميل...',
        'no-key-found' => 'لا توجد مفاتيح SSH لهذا الحساب.',
        'added-on' => 'تاريخ الإضافة',

        'createForm' => [
            'key-name' => 'اسم مفتاح SSH',
            'public-key' => 'المفتاح العام',
            'public-key-desc' => 'أدخل مفتاح SSH العام الخاص بك.',
            'save' => 'حفظ',
        ],

        'deleteForm' => [
            'delete-ssh-key' => 'حذف مفتاح SSH',
            'delete-key' => 'حذف المفتاح',
            'will-invalidate-1' => 'إن إزالة مفتاح SSH',
            'will-invalidate-2' => 'ستؤدي إلى إبطال استخدامه عبر اللوحة بالكامل.',
        ],
    ],

    'profile' => [
        'update-profile' => 'تحديث الملف الشخصي',
        'first-name' => 'الاسم الأول',
        'last-name' => 'الاسم الأخير',
        'username' => 'اسم المستخدم',
        'updated-success' => 'تم تحديث الملف الشخصي بنجاح.',
    ],

    'recoveryTokensDialog' => [
        'title' => 'تم تفعيل التحقق بخطوتين',
        'description' => 'احفظ الرموز أدناه في مكان آمن. إذا فقدت إمكانية الوصول إلى هاتفك، يمكنك استخدام رموز الطوارئ هذه لتسجيل الدخول.',
        'alert' => 'لن يتم عرض هذه الرموز مرة أخرى.',
        'doneButton' => 'تم',
    ],
];
