<?php

return [
    'support' => 'مركز الدعم',

    'login' => [
        'title' => 'تسجيل الدخول للمتابعة',
        'username-or-email' => 'اسم المستخدم أو البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'forgot-password' => 'نسيت كلمة المرور؟',
        'login' => 'تسجيل الدخول',

        'must-be-provided' => 'يجب إدخال اسم المستخدم أو البريد الإلكتروني.',
        'new-here' => 'مستخدم جديد؟ أنشئ حساباً.',
        'please-enter-password' => 'يرجى إدخال كلمة مرور حسابك',
    ],

    'forgot' => [
        'title' => 'طلب إعادة تعيين كلمة المرور',
        'email' => 'البريد الإلكتروني',
        'email-description' => 'أدخل عنوان بريدك الإلكتروني لتلقي تعليمات إعادة تعيين كلمة المرور.',
        'send-email' => 'إرسال البريد الإلكتروني',
        'return-to-login' => 'العودة إلى تسجيل الدخول',

        'a-valid-email-provided' => 'يجب إدخال عنوان بريد إلكتروني صالح للمتابعة.',
    ],

    'device' => [
        'title' => 'التحقق من الجهاز',
        'recovery-code' => 'رمز الطوارئ',
        'authentication-code' => 'رمز المصادقة',

        'continue' => 'متابعة',

        'lost-device' => 'فقدت جهازي',
        'have-device' => 'جهازي معي',

        'return-to-login' => 'العودة إلى تسجيل الدخول',

        'enter-one-of-recovery-codes' => 'أدخل أحد رموز الطوارئ التي تم إنشاؤها عند إعداد المصادقة الثنائية في هذا الحساب للمتابعة.',
        'enter-two-factor' => 'أدخل رمز المصادقة الثنائية الصادر من جهازك',
    ],

    'register' => [
        'title' => 'إنشاء حساب جديد',
        'username' => 'اسم المستخدم',
        'firstname' => 'الاسم الأول',
        'lastname' => 'الاسم الأخير',
        'email' => 'البريد الإلكتروني',
        'register' => 'تسجيل حساب',

        'already-have-account' => 'هل لديك حساب بالفعل؟',

        'username-required' => 'اسم المستخدم مطلوب.',
        'email-required' => 'عنوان البريد الإلكتروني مطلوب.',
        'valid-email-required' => 'يجب إدخال عنوان بريد إلكتروني صالح.',
        'firstname-required' => 'الاسم الأول مطلوب.',
        'lastname-required' => 'الاسم الأخير مطلوب.',

        'valid-username-required' => 'يجب إدخال اسم مستخدم صالح (من 3 إلى 16 حرفاً، أحرف وأرقام وشرطات وشرطات سفلية فقط).',
        'username-taken' => 'اسم المستخدم المدخل مستخدم بالفعل.',

        'success-message' => 'تم إنشاء الحساب بنجاح، يرجى مراجعة بريدك الإلكتروني',
    ],

    'reset' => [
        'title' => 'إعادة تعيين كلمة المرور',

        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'confirm-password' => 'تأكيد كلمة المرور الجديدة',

        'return-to-login' => 'العودة إلى تسجيل الدخول',
        
        'password-required' => 'كلمة المرور الجديدة مطلوبة.',
        'at-least-8-characters' => 'يجب أن تتكون كلمة المرور الجديدة من 8 أحرف على الأقل.',
        'password-does-not-match' => 'كلمة المرور الجديدة غير متطابقة.',
    ],
];
